export const winCombinations = [
  // Ряды
  [
    [0, 0],
    [0, 1],
    [0, 2],
  ], // Верхний ряд
  [
    [1, 0],
    [1, 1],
    [1, 2],
  ], // Средний ряд
  [
    [2, 0],
    [2, 1],
    [2, 2],
  ], // Нижний ряд

  // Столбцы
  [
    [0, 0],
    [1, 0],
    [2, 0],
  ], // Левый столбец
  [
    [0, 1],
    [1, 1],
    [2, 1],
  ], // Средний столбец
  [
    [0, 2],
    [1, 2],
    [2, 2],
  ], // Правый столбец

  // Диагонали
  [
    [0, 0],
    [1, 1],
    [2, 2],
  ], // Главная диагональ
  [
    [0, 2],
    [1, 1],
    [2, 0],
  ], // Побочная диагональ
];
